partitioned-pipe/fluid2-openfoam-rhoPimpleFoam/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Fluid2;

modules (FF);

interfaces
{
  Interface1
  {
    mesh              Fluid2-Mesh;
    patches           (inlet);
    
    readData
    (
      Velocity
      PressureGradient
    );
    
    writeData
    (
      Pressure
    );
  };
};
